{"title":"Boris' video resume. Software developer. PHP\/Laravel\/VueJS","description":"I am a Russian software developer based out of Moscow with 9+ years of experience in the field of trading and finance. My classical Russian higher education, internship in the USA, and Master’s in Information Technologies have given me the breadth skills I needed to develop unique, complicated projects such as trading bots, cryptocurrency strategies, and web scrapping algos. My objective is always to challenge myself with the funnest, most inspirational projects as possible, whether as a developer or team member. Furthermore, I love discovering new technologies and delivering a high-quality product (software) to the customer right within the discussed time frame. I enjoy working in multicultural environments as well as in roles where I’m interacting with clients face to face. Furthermore, I have successfully completed many projects for US and EU clients. \n\nTechnology stack: \nPhp, Laravel, Guzzle, Ratchet\/Pawl, REST API, Websocket development  \nJavaScript\/JQuery, VueJS, ExtJS, AJAX, HTML\/Bootstrap, HighCharts\/HighStock\nMySql, PostgreSql, MongoDB\n.NET C#, MS Access (DB), Selenium, SadConsole \n\n.NET\/Microsoft: \n1. Console and windows-form application development (used for console commands and system demon dev when web API or websocket access is not provided)\n2. Selenium autotests and web scraping (used for pulling data from services where API is unavailable or data usage is restricted) \n3. MS Access\/MS SQL Database development \n\nCrypto exchanges:\n1. Freshly developed, ready to use connectors: Bitfinex, Kraken, Poloniex, BitMEX, and Coinbase\/GDAX.\n\nTrading bots\/Algorithms\/Stock market: \n1. Technical analysis\/order book strategy development (stock\/derivatives\/cryptocurrencies)\n2. Arbitrage and high frequency strategies. Both the crypto and stock markets, including mixed exchange integration like CME\/Bitfinex, NYSE\/MOEX, etc.\n3. Strategy back-testing and optimization \n4. Custom indicators development (math and statistics approach)\n5. Robust data visualization. Strategy presentations, charts, diagrams, reports, etc.\n6. Ready solutions (connectors) and exchange Integration (Interactive Brokers, Bloomberg, exchanges, etc.)\n\nUpwork profile: https:\/\/www.upwork.com\/o\/profiles\/users\/_~012c760e2faf351472\/ \nFacebook: https:\/\/www.facebook.com\/b.voinov \nInstagram: https:\/\/www.facebook.com\/b.voinov","thumbnails":{"default":{"url":"https:\/\/i.ytimg.com\/vi\/Rn3VKA6Ms04\/default.jpg","width":120,"height":90},"medium":{"url":"https:\/\/i.ytimg.com\/vi\/Rn3VKA6Ms04\/mqdefault.jpg","width":320,"height":180},"high":{"url":"https:\/\/i.ytimg.com\/vi\/Rn3VKA6Ms04\/hqdefault.jpg","width":480,"height":360},"standard":{"url":"https:\/\/i.ytimg.com\/vi\/Rn3VKA6Ms04\/sddefault.jpg","width":640,"height":480},"maxres":{"url":"https:\/\/i.ytimg.com\/vi\/Rn3VKA6Ms04\/maxresdefault.jpg","width":1280,"height":720}},"snippets":{"url":"https:\/\/www.youtube.com\/watch?v=Rn3VKA6Ms04","video":"https:\/\/www.youtube.com\/embed\/Rn3VKA6Ms04?autoplay=1","image":"https:\/\/i.ytimg.com\/vi\/Rn3VKA6Ms04\/maxresdefault.jpg","width":1280,"height":720},"api_url":"https:\/\/www.googleapis.com\/youtube\/v3\/videos","api_params":{"part":"snippet","fields":"items(snippet(title,description,thumbnails))","id":"Rn3VKA6Ms04","key":"AIzaSyBdvMJsZReCKbfORDLhCl1KJfqR4fCLFHw"}}